In [2]:
!conda list | grep pandas

pandas                    0.24.0                   pypi_0    pypi

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('data/friend_list.csv')

In [5]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [6]:
df.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

아래는 Tab 구분 인자를 읽는 방법

In [9]:
df = pd.read_csv('data/friend_list_tab.txt',delimiter = '\t')

In [11]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [15]:
df = pd.read_csv('data/friend_list_no_head.csv',delimiter = ',', header = None)

In [16]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [17]:
df.columns = ['name','age','job']

In [18]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

아래는 헤더가 없는 파일을 한번에 실행하는 방법

In [19]:
df = pd.read_csv('data/friend_list_no_head.csv',delimiter = ',', header = None, names = ['name','age','job'])

In [20]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern